import React from 'react';

function Confidentiality() {
  return (
    <div>
      <h2>Соглашение о конфиденциальности</h2>
      <p>
        Дата последнего обновления: 28 октября 2025 г. Версия 1.

1. Общие положения
Настоящая Политика конфиденциальности (далее — «Политика») регулирует порядок сбора, обработки, хранения и защиты персональных данных пользователей (далее — «Пользователи») мобильного приложения «Доставка» (далее — «Приложение»).
Использование Приложения означает безоговорочное согласие Пользователя с настоящей Политикой. В случае несогласия с условиями Пользователь должен немедленно прекратить использование Приложения.
Настоящая Политика конфиденциальности распространяется и применяется исключительно на территории Российской Федерации.

Оператором персональных данных является ИП Жуков Артём Владимирович, зарегистрированный по адресу: Чукотский АО, г. Анадырь, ул. Отке дом 1 кв 18 (далее — «Мы»).

2. Какие данные мы собираем
Мы собираем несколько типов информации для предоставления и улучшения нашего сервиса.
Данные, предоставляемые Пользователем:
Личная информация: имя, номер телефона, адрес электронной почты.
Адресные данные: адрес доставки (улица, дом, квартира), данные для определения местоположения.
Платежные данные: информация о платежных картах (номер, срок действия, код CVC — обрабатывается только через защищенные платежные системы), данные о транзакциях.
Профильные данные: информация, добавленная в профиль Пользователя (например, фотография).
Отзывы и комментарии: обратная связь о ресторанах и доставке.
Данные, собираемые автоматически:
Технические данные: информация об устройстве (тип устройства, модель, операционная система, IP-адрес), данные о сбоях, настройки.
Данные о местоположении: точная или приблизительная информация о местоположении устройства для определения зоны доставки и отслеживания заказа.
Файлы cookie и аналогичные технологии: для улучшения работы Приложения, персонализации контента и анализа трафика.
3. Цели сбора и обработки данных
Мы используем собранные данные для следующих целей:
Регистрации и управления аккаунтом: создание и поддержание профиля Пользователя.
Оказание услуг: обработка и доставка заказов, предоставление информации о статусе заказа.
Персонализация: отображение релевантного контента, предложений и рекламы.
Коммуникация: отправка уведомлений о заказах, акциях и обновлениях (с согласия Пользователя).
Поддержка: обеспечение технической поддержки и решение проблем Пользователей.
Улучшение сервиса: анализ данных для оптимизации работы Приложения и улучшения качества обслуживания.
Безопасность: предотвращение мошенничества и обеспечение безопасности Пользователей и сервиса.
Правовые требования: выполнение законодательных обязательств.
4. Передача данных третьим лицам
Мы можем передавать данные третьим лицам для обеспечения работы Приложения и предоставления услуг.
Партнеры по доставке: курьерам и службам доставки для выполнения заказов.
Клиентам: для связи с курьерами и получения адреса для самовывоза.
Рестораны, заведения, магазины: для обработки, приготовления заказов и подготовки товаров.
Платежные системы: для обработки платежей.
Аналитические и рекламные сервисы: для анализа использования Приложения и показа релевантной рекламы.
Правоохранительные органы: по законному запросу.
Передача данных за пределы РФ: не осуществляется.
5. Права Пользователя
Пользователь имеет право:
Доступ и исправление: получать доступ к своим данным, изменять и обновлять их в профиле.
Удаление: запрашивать удаление своих персональных данных.
Отозвать: отозвать согласие на обработку персональных данных, направив уведомление посредством электронной почты на электронный адрес dostavka24.service@yandex.ru с пометкой «Отзыв согласия на обработку персональных данных».
Ограничение обработки: отозвать согласие на обработку данных, например, отписаться от рассылок.
Возражение: возражать против обработки данных в определенных случаях.
6. Безопасность данных
Мы принимаем необходимые организационные и технические меры для защиты персональных данных от несанкционированного доступа, уничтожения, кражи, потери, изменения и разглашения.
Однако ни один метод передачи данных через Интернет не является полностью безопасным, и мы не можем гарантировать абсолютную защиту.
7. Как мы храним ваши данные
Мы храним ваши данные в течение того периода, который необходим для предоставления услуг и достижения иных целей, указанных в настоящей политике.
Сроки хранения различаются в зависимости от типа данных, категории Пользователя и целей, в которых мы используем эти данные.
Когда мы обрабатываем ваши данные для предоставления услуг, мы храним данные пока ваша учетная запись не удалена. Мы вправе хранить данные Пользователя после удаления учетной записи в соответствии с законодательными или иными нормативными требованиями. 
Мы будем хранить информацию о транзакциях и о заказах, в течение срока, необходимого для выполнения налоговых обязательств. Мы также храним данные с целью предоставления ответа на любые претензии в отношении услуг.
8. Условия изменения Политики
Мы можем обновлять настоящую Политику время от времени. Об изменениях будет сообщено в Приложении или на сайте. Продолжая использовать Приложение после публикации обновлений, Пользователь соглашается с ними.
9. Контактная информация
По вопросам, касающимся настоящей Политики конфиденциальности, Пользователи могут обращаться по адресу: dostavka24.service@yandex.ru.
Настоящая Политика конфиденциальности размещена по адресу: https://dostavka24-7.ru/confidentiality.
      </p>
    </div>
  );
}

export default Confidentiality;
