import React from 'react';

function NoPublicOffer() {
  return (
    <div style={{ padding: 20, maxWidth: 900, margin: '0 auto',  }}>
      <h2>
        ДОГОВОР-ОФЕРТА № П-2026 на оказание услуг сервиса «Север Гоу» (для партнеров)
      </h2>
      <pre
        style={{
          fontFamily: 'monospace',
          whiteSpace: 'pre-wrap',
          fontSize: 14,
          color: '#222',
          lineHeight: 1.6,
          background: '#fff',
          textAlign: 'left'
        }}>
        <code>{`Дата последнего обновления: 22 мая 2026 г. Версия 1.0.
г. Анадырь
1. ОБЩИЕ ПОЛОЖЕНИЯ
1.1. Настоящий документ является официальным предложением ИП Жукова Артёма Владимировича (ИНН 870902038496, ОГРНИП 326870000001178), именуемого в дальнейшем «Исполнитель», заключить Договор об оказании услуг с любым юридическим лицом или индивидуальным предпринимателем (далее — «Партнер»).
1.2. Акцептом (принятием) Оферты является проставление Партнером отметки («галочки») в соответствующем поле в Личном кабинете сервиса «Север Гоу».
1.3. Стороны признают, что проставление отметки является использованием простой электронной подписи и приравнивается к подписанию Договора обеими Сторонами на бумажном носителе.

2. ПРЕДМЕТ ДОГОВОРА
2.1. Исполнитель за вознаграждение оказывает Партнеру услуги по размещению его Меню в мобильном приложении «Север Гоу», привлечению Клиентов и передаче Заказов.
2.2. Партнер обязуется своевременно обрабатывать Заказы и оплачивать услуги Исполнителя в порядке и сроки, установленные настоящим Договором.

3. ИНФОРМАЦИОННОЕ ВЗАИМОДЕЙСТВИЕ
3.1. Стороны признают юридическую силу за уведомлениями, направленными через мобильное приложение «Север Гоу», а также мессенджеры (Telegram, WhatsApp, Макс) по номерам телефонов, указанным в Личном кабинете сервиса «Север Гоу».
3.2. Заказ считается полученным Партнером в момент его отображения в мобильном приложении Партнера или Личном кабинете.

4. СТОИМОСТЬ УСЛУГ И ПОРЯДОК РАСЧЕТОВ
4.1. Стоимость услуг Исполнителя является фиксированной и составляет 50 (пятьдесят) рублей 00 копеек за каждый полученный Партнером Заказ.
4.2. Если Партнер получил Заказ в приложении, но впоследствии отменил его по своей вине (нет продуктов, загруженность кухни и т.д.), услуга Исполнителя считается оказанной в полном объеме. Такой Заказ подлежит оплате согласно п. 4.1.
4.3. В случае, если Клиент производит оплату Заказа безналичным путем через Сервис (в мобильном приложении), расходы по оплате банковской комиссии за эквайринг несет Партнер.
4.4. Отчетным периодом является календарный месяц.
4.5. В течение первых 3-х рабочих дней месяца, следующего за отчетным, Исполнитель выставляет Партнеру счет на оплату.
4.6. Партнер обязан оплатить счет в течение 5 (пяти) банковских дней с момента его получения.

5. ОТВЕТСТВЕННОСТЬ И САНКЦИИ
5.1. За просрочку оплаты Партнер выплачивает пеню в размере 1% от суммы долга за каждый день просрочки.
5.2. При задержке оплаты более чем на 7 рабочих дня Исполнитель вправе приостановить доступ Партнера к Сервису (скрыть Меню в приложении) до полной оплаты долга.
5.3. При систематических отменах заказов (более 3-х раз в неделю по вине Партнера), Исполнитель вправе временно ограничить отображение Партнера в приложении.
5.4. Партнер несет полную ответственность за качество, свежесть и безопасность приготовленных блюд перед Клиентом.

6. СРОК ДЕЙСТВИЯ И РАСТОРЖЕНИЕ
6.1. Договор вступает в силу с момента акцепта («галочки») и действует 1 (один) год с автоматической пролонгацией.
6.2. Любая Сторона может расторгнуть Договор, уведомив другую Сторону за 14 дней через мессенджеры или электронным письмом.

7. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ
ИП Жуков Артём Владимирович
ИНН: 870902038496 / ОГРНИП 326870000001178
Адрес: РФ, 689000, Чукотский АО, г. Анадырь, ул. Отке, дом 1, кв. 18.
Email: dostavka24.service@yandex.ru
Тел.: +79145353829
 
      `}</code>
      </pre>
    </div>
  );
}

export default NoPublicOffer;
